simulations/fluid-openfoam/case-template/0/U.template
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| 	/  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  	/   O peration     | Version:  v2312                                 |
|   	/    A nd           | Website:  www.openfoam.com                      |
|    	/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ({{ inlet_velocity[0] }} {{ inlet_velocity[1] }} {{ inlet_velocity[2] }});
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    obstacle
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
